Public Member Functions | List of all members
API_IPropertyGroupEventHandler Class Reference
Notifications Manager
The base class you need to inherit from in case you want to handle API_PropertyGroup events. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IPropertyGroupEventHandler:
 Public Member Functions
virtual GS::UniString  | GetName () const override final
virtual void  | Dispatch (const API_IEventNotifier &eventNotifier) const override final
It dispatches the event.
virtual GS::UniString  | GetName () const =0
virtual void  | Dispatch (const API_IEventNotifier &eventNotifier) const =0
It dispatches the event.
 Public Member Functions inherited from API_IObjectEventHandler
 virtual void  | OnCreated (const GS::HashSet< API_Guid > &) const
Event handler for object creation events.
 virtual void  | OnModified (const GS::HashSet< API_Guid > &) const
Event handler for object modification events.
 virtual void  | OnDeleted (const GS::HashSet< API_Guid > &) const
Event handler for object deletion events.
Detailed Description
The base class you need to inherit from in case you want to handle API_PropertyGroup events.
Since
Archicad 26
Member Function Documentation
◆ Dispatch()
 virtual void API_IPropertyGroupEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotifier | ) |   const
inlinefinaloverridevirtual
It dispatches the event.
Parameters
eventNotifier | The occurrence of an event can be notified via this parameter.
Implements API_IEventHandler.
◆ GetName()
 virtual GS::UniString API_IPropertyGroupEventHandler::GetName  |  ( |   | ) |   const
inlinefinaloverridevirtual
Returns
Human readable name of the event handler.
Implements API_IEventHandler.